{"keras_version": "2.2.3", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 200, 200, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 200, 200, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 150, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 150, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 150, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "relu", "trainable": true, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 4, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "sigmoid", "trainable": true, "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null}}]}}